var ary = [12, 23, 14, 25, 34, 11, 16];

/*
 * 能否利用Math.max/Math.min实现我们的需求?
 *   Math.max([12, 23, 14...]) =>NaN
 *   Math.max(12, 23, 14...) =>34  执行MAX方法,我们需要把比较的一堆数值一项项的传递给这个方法才可以,传递一个数组整体是不行的
 */

//=>第一次尝试:
//=>[12, 23, 14, 25, 34, 11, 16].toString() : "12,23,14,25,34,11,16"
//=>eval("12,23,14,25,34,11,16") ：16 只有最后一项

//=>JS中的括号表达式:
//1、小括号中出现多项(每一项之间用逗号分隔),操作只有最后一项
// (function () {
//     console.log(1);
// }, function () {
//     console.log(2);
// })();//=>2 只把第二个函数执行了,第一个不操作

//2、括号表达式会影响THIS的指向
//=>括号中只有一项,THIS还是按照没加括号的时候处理即可
//=>括号中有多项,执行最后一项的时候,方法中的THIS就是WINDOW(UNDEFINED) [浏览器把这种情况理解为自执行函数执行处理的]
// window.name = 'WIN';
// function fn() {
//     console.log(this.name);
// }
// var obj = {name: 'OBJ', fn: fn};
// obj.fn();//=>'OBJ'
// (obj.fn)();//=>'OBJ'
// (fn, obj.fn)();//=>'WIN'  严格模式下THIS:UNDEFINED